[
  { "name": "Простая Территория", "weight": 25, "description": "создаёт область, где снижается урон от любой проклятой техники. В традиционной форме техника создаёт круг длиной примерно 2 метра вокруг пользователя от заданной точки, которую он выбирает и устанавливает ногами. " },
  { "name": "Чувства Опадающего Цветка", "weight": 20, "description": "Техника, позволяющая мгновенно отражать атаки если принять особую стойку" },
  { "name": "Новый Теневой Стиль", "weight": 18, "description": "Школа кендзюцу, предполагающая использование простой территории. Усиливает владение катаной" },
  { "name": "Чёрная Вспышка", "weight": 15, "description": "Мощный удар, вводящий в состояние 'потока'. Срабатывает с низким шансом" },
  { "name": "Обратная Проклята Техника (только на себя)", "weight": 12, "description": "Перемножает проклятую энергию друг на друга, позволяя получить положительную энергию и исцелить свои раны. Необходим как минимум средний запас проклятой энергии для эффективного использования." },  { "name": "Выброс Обратной Проклятой Техники", "weight": 10, "description": "Проекция положительной энергии для атаки проклятых духов" },
  { "name": "Выброс Обратной Проклятой Техники", "weight": 10, "description": "Перемножает проклятую энергию друг на друга, позволяя получить положительную энергию и касанием передать её проклятому духу, нанося им катастрофический урон. Не наносит урона людям. Необходим запас проклятой энергии выше среднего" },
  { "name": "Обратная Проклятая Техника (лечение мозга)", "weight": 8, "description": "Перемножает проклятую энергию друг на друга, позволяя получить положительную энергию и исцелить свой собственный мозг, сокращая перезарядку приемов и позволяя раскрыть территорию ещё раз" },
  { "name": "Растяжение Территории", "weight": 15, "description": "техника покрывает тело пользователя и защищает от проклятых техник, а так же нейтрализует их если вступает в контакт." },
  { "name": "Незавершённая Территория", "weight": 12, "description": "Неполная версия Расширения Территории без барьера, не имеющий гарантированного попадания по противнику. Увеличивает силу Проклятой Техники"},
  { "name": "Расширение Территории", "weight": 10, "description": "Вершина боевых навыков заклинателя, при которой огромное количество проклятой энергии расходуется на создание личной территории, окружающую пользователя техники. Техника позволяет создать нужное окружения для преимущества в битве, также способности, примененные внутри территории всегда точно поражают противника. Самый эффективный способ противостоять чужому раскрытию владений - это собственное раскрытие владений, победит тот, у кого лучше контроль и количество проклятой энергии." },
  { "name": "Анти-Барьерное Расширение Территории", "weight": 6, "description": "Это расширение территории, которое идеально противостоит любым Расширениям Территории" },
  { "name": "Безбарьерное Расширение Территории", "weight": 4, "description": "Расширение Терртории, который не создаёт барьер, давая возможность побега оппонентам с одной стороны, позволяя свободно регулировать размеры барьера с другой, а также создающий связывающий обет, усиливающий технику барьера" }
]