[
  {
    "id": "mission_001",
    "name": "Проклятая Больница Мутаций",
    "description": "Больница превратилась в настоящий ад после того, как проклятый дух Особого Ранга Махито использовал свою Инертную Трансформацию на всех пациентах и врачах. Теперь здание кишит ужасными мутантами, а сам Махито ждёт в глубине больницы, экспериментируя с формой человеческих душ.",
    "threat": "Махито - проклятый дух Особого Ранга с техникой Инертной Трансформации, способный изменять форму души и тела. Окружён ордами мутантов, созданных из бывших людей.",
    "objectives": [
      "Пробиться через толпы мутантов",
      "Достичь Махито в глубине больницы",
      "Уничтожить Махито и остановить мутации",
      "Предотвратить распространение проклятия за пределы больницы"
    ],
    "dangerFactors": [
      "Множественные мутанты с непредсказуемыми способностями",
      "Махито может мгновенно убить прикосновением к душе",
      "Техника Трансфигурации может превратить союзников в мутантов",
      "Нестабильная структура здания из-за деформированной архитектуры",
      "Махито обладает высоким интеллектом и тактическим мышлением"
    ],
    "difficulty": "Экстремальная",
    "isCustom": false
  },
  {
    "id": "mission_002",
    "name": "Сендайская Колония",
    "description": "Одна из самых смертоносных колоний. Здесь действуют четыре невероятно мощных противника: Друхва и его Сикигами, Рю Исигори с его огромным запасом проклятой энергии, Такако Уро с её техникой управления небом, и проклятый дух Особого Ранга Куроуруси, способный призывать рои проклятых насекомых. Выжить здесь могут только сильнейшие.",
    "threat": "Четыре мощнейших противника: Друхва, Рю Исигори, Такако Уро, Куроуруси",
    "objectives": [
      "Победить Друхву и его сикигами",
      "Уничтожить Рю Исигори несмотря на его огромный запас энергии",
      "Преодолеть техники пространственной манипуляции Такако Уро",
      "Уничтожить проклятого духа Куроуруси и его рои",
      "Выжить в столкновении со всеми четырьмя противниками"
    ],
    "dangerFactors": [
      "Друхва может призывать множество мощных сикигами одновременно",
      "Исигори обладает наибольшим запасом проклятой энергии в истории",
      "Такако манипулирует пространством и может превратить небо в оружие",
      "Куроуруси контролирует бесконечные рои проклятых насекомых",
      "Все четверо способны использовать РТ",
      "Противники могут объединяться против общей угрозы"
    ],
    "difficulty": "Экстремальная",
    "isCustom": false
  },
  {
    "id": "mission_003",
    "name": "Вторая Токийская Колония",
    "description": "В этой колонии доминирует один-единственный игрок - Хадзиме Касимо, легендарный шаман из эпохи 400 лет назад. Его электрифицированная проклятая энергия делает защиту от его атак невозможной, а его молния, которая разрывает воздух, гарантированно поражает цель без необходимости в доменном расширении. Касимо жаждет только одного - достойной битвы.",
    "threat": "Хадзиме Касимо - сильнейший шаман своей эпохи (400 лет назад), мастер рукопашного боя с электрифицированной проклятой энергией. Его молнии невозможно избежать, а физические атаки наносят электрический шок при контакте.",
    "objectives": [
      "Выжить против Касимо достаточно долго, чтобы найти его слабости",
      "Победить легендарного шамана из прошлого"
    ],
    "dangerFactors": [
      "Электрифицированная проклятая энергия делает защиту от ударов невозможной",
      "Молния Касимо разрывает воздух и гарантированно попадает без домена",
      "Мастерское владение рукопашным боем и тайцзюцу",
      "Исключительный тактический интеллект и опыт сотен битв",
      "Касимо может разряжать молнии через противника как проводник",
      "Естественная слабость к воде может быть использована против команды",
      "Врождённая техника 'Мифический Янтарный Зверь' превосходит пределы человека",
      "Владеет 'Полым Плетёным Барьером' - предшественником Простого Домена",
      "Посох Нёй может накапливать электрические заряды",
      "После активации врождённой техники тело Касимо разрушается - он будет сражаться до конца"
    ],
    "difficulty": "Экстремальная",
    "isCustom": false
  },
  {
    "id": "mission_004",
    "name": "Shinjuku Showdown - Битва в Синдзюку",
    "description": "Финальная битва человечества против величайшей угрозы в истории - Рёмен Сукуны в его истинной форме. Король Проклятий восстановил своё настоящее тело с четырьмя руками, двумя лицами и полной мощью. Рядом с ним стоит Ураумэ, древний шаман-слуга с ледяной магией. Это битва за само существование мира шаманов. Только сильнейшие из сильнейших имеют шанс выжить.",
    "threat": "Рёмен Сукуна - сильнейший шаман в истории, Король Проклятий в истинной форме (4 руки, 4 глаза, рот на животе). Владеет техникой 'Храм' с Расчленением, Разрезанием и Божественным Пламенем. Ураумэ - древний ледяной шаман, способный заморозить всё вокруг.",
    "objectives": [
      "Выжить против Сукуны в его истинной форме",
      "Преодолеть защиту Ураумэ и их ледяную магию",
      "Разрушить Злонамеренный Храм - Доменное Расширение Сукуны",
      "Предотвратить использование Сукуной Божественного Пламени на город",
      "Победить Короля Проклятий или погибнуть, пытаясь"
    ],
    "dangerFactors": [
      "Сукуна - сильнейший шаман за всю тысячелетнюю историю",
      "Злонамеренный Храм не создаёт барьер - радиус 200 метров гарантированного попадания",
      "Расчленение и Разрезание могут разрезать что угодно, включая пространство",
      "Божественное Пламя превосходит огонь Джого и может испепелить город",
      "4 руки позволяют одновременно использовать печати и сражаться",
      "2 рта позволяют непрерывно читать усиленные заклинания",
      "Владеет Обратной Проклятой Техникой на высочайшем уровне",
      "Может восстановить сожжённую технику, регенерируя часть мозга",
      "Амплификация Домена нейтрализует техники противников",
      "Владеет Полым Плетёным Барьером для защиты от доменов",
      "Использует Камутокэ - проклятый инструмент с электричеством",
      "Использует Хитэн - трёхзубый трезубец с неизвестными способностями",
      "Ураумэ может мгновенно заморозить множество противников техникой 'Морозное Затишье'",
      "Ледопад Ураумэ создаёт телекинетические ледяные осколки",
      "Ураумэ владеет Обратной Проклятой Техникой для регенерации",
      "Ураумэ удерживал на равных Хакари, одного из сильнейших студентов",
      "Уникальная структура тела Сукуны не имеет слабостей",
      "Сукуна осознаёт форму своей души и может её восстанавливать"
    ],
    "difficulty": "Экстремальная",
    "isCustom": false
  },
  {
    "id": "mission_005",
    "name": "Инцидент в Сибуя: Огонь, Растения и Кровь",
    "description": "Сибуя превратилась в поле битвы. Три могущественных противника координируют атаку: Джого - проклятый дух Особого Ранга с разрушительным пламенем, способным испепелить город; Ханами - дух природы с контролем над растениями и регенерацией; и Чосо - гибрид проклятия и человека, мастер манипуляции кровью. Вместе они представляют смертельную угрозу для всех в районе.",
    "threat": "Три противника: Джого (огненный дух Особого Ранга с доменным расширением), Ханами (дух природы с регенерацией и контролем растений), Чосо (манипуляция кровью и защита братьев)",
    "objectives": [
      "Остановить Джого до того, как он сожжёт весь район Сибуя",
      "Преодолеть регенерацию Ханами и его защиту растениями",
      "Победить Чосо и его смертоносные техники манипуляции кровью",
      "Защитить гражданских от огня, растений и крови",
      "Выжить против скоординированной атаки трёх мощных противников"
    ],
    "dangerFactors": [
      "Джого может мгновенно испепелить человека одним касанием",
      "Пламя Джого достигает температуры вулканической лавы",
      "Доменное Расширение Джого 'Гроб Железной Горы' - мгновенная смерть",
      "Ханами обладает невероятной физической силой и выносливостью",
      "Растения Ханами могут высасывать жизненную энергию",
      "Ханами регенерирует повреждения через свою связь с природой",
      "Чосо владеет техникой 'Пронзающая Кровь' - сверхзвуковой снаряд",
      "Техника 'Текучее Красное Варево' создаёт щит из кипящей крови",
      "Чосо может отслеживать своих братьев и чувствовать опасность",
      "Все трое координируют атаки и прикрывают слабости друг друга",
      "Джого может создавать метеоритные удары",
      "Ханами использует 'Проклятую Технику: Цветок-Людоед'",
      "Городская среда даёт преимущество противникам - много укрытий"
    ],
    "difficulty": "Экстремальная",
    "isCustom": false
  },
  {
    "id": "mission_006",
    "name": "Инцидент в Сибуя: Владыка Океана",
    "description": "Дагон, проклятый дух Особого Ранга, достиг своей полной формы. Этот древний дух воплощает страх человечества перед океаном. Его доменное расширение 'Горизонт Бескрайнего Вестибюля' создаёт целый океан смерти, где враги тонут под бесконечными атаками морских существ. Дагон непобедим в своём домене, и единственный способ выжить - разрушить его изнутри.",
    "threat": "Дагон - проклятый дух Особого Ранга в полной форме, воплощение страха перед океаном. Владеет доменным расширением с гарантированным попаданием и призывом морских духов.",
    "objectives": [
      "Выжить в доменном расширении Дагона",
      "Найти способ разрушить 'Горизонт Бескрайнего Вестибюля'",
      "Преодолеть бесконечные волны морских существ",
      "Уничтожить Дагона до того, как он утопит всех",
      "Защитить союзников от гарантированных ударов домена"
    ],
    "dangerFactors": [
      "Доменное Расширение Дагона имеет гарантированное попадание",
      "Бесконечный поток морских духов-сикигами атакует со всех сторон",
      "Дагон может призывать акул-убийц с разрушительной силой",
      "В домене Дагон практически непобедим",
      "Вода в домене реальна и может утопить жертв",
      "Дагон обладает невероятной скоростью и силой в воде",
      "Его техника 'Смертельный Рой' создаёт тысячи атак одновременно",
      "Дагон может регенерировать повреждения внутри своего домена",
      "Барьер домена чрезвычайно прочен",
      "Без анти-доменной техники выжить практически невозможно",
      "Дагон был одним из сильнейших духов группы Махито",
      "В полной форме Дагон достиг статуса Особого Ранга"
    ],
    "difficulty": "Экстремальная",
    "isCustom": false
  },
  {
    "id": "mission_007",
    "name": "Инцидент в Сибуя: Древнее Зло",
    "description": "Истинный мастермайнд за Инцидентом в Сибуя - Кэндзяку, древнее проклятие возрастом в тысячу лет, занявшее тело Сугуру Гето. Этот злодей манипулировал событиями веками, собирая армию из тысяч проклятых духов. Его техника 'Манипуляция Проклятыми Духами' позволяет контролировать любых побеждённых духов, а его знание дзюдзюцу превосходит всех живущих. Кэндзяку - угроза не только Сибуе, но и всему миру.",
    "threat": "Кэндзяку - древний злодей в теле Гето, владеющий техникой манипуляции тысячами проклятых духов. Обладает знаниями тысячелетий и множеством техник.",
    "objectives": [
      "Противостоять армии из тысяч проклятых духов Кэндзяку",
      "Раскрыть истинные планы древнего злодея",
      "Остановить Кэндзяку до того, как он активирует своё истинное проклятие",
      "Победить противника с опытом в тысячу лет",
      "Предотвратить захват ещё большего количества духов"
    ],
    "dangerFactors": [
      "Кэндзяку может призвать тысячи проклятых духов одновременно",
      "Владеет техникой 'Манипуляция Проклятыми Духами' из тела Гето",
      "Может использовать техники всех захваченных духов",
      "Обладает знаниями дзюдзюцу за тысячу лет",
      "Владеет Доменным Расширением 'Обитель Воющих Множеств'",
      "Может переключаться между тысячами различных техник",
      "Использует Узумаки - концентрацию сотен духов в один удар",
      "Кэндзяку манипулировал историей веками",
      "Может захватывать души побеждённых духов",
      "Владеет анти-барьерными техниками",
      "Исключительный тактический интеллект",
      "Может переносить своё сознание в другие тела",
      "В его арсенале духи Особого Ранга",
      "Кэндзяку был наставником Сукуны в прошлом"
    ],
    "difficulty": "Экстремальная",
    "isCustom": false
  }
]
